In [2]:
import pandas as pd

a_col = ['id', 'customer_id', 'customer_name']
a_data = [[1,1,'Robert'], [2, 2, 'Peter'], [3, 3, 'Dave']]
a = pd.DataFrame(a_data, index = a_col)
a

               0  1       2
id             1  1  Robert
customer_id    2  2   Peter
customer_name  3  3    Dave

In [3]:
a_data ={'id' : [1, 2, 3],
        'customer_id' : [1, 2, 3],
         'customer_name' : ['Robert', 'Peter', 'Dave']
        }
a = pd.DataFrame(a_data)
a

   id  customer_id customer_name
0   1            1        Robert
1   2            2         Peter
2   3            3          Dave

In [4]:
b_data = { 'id' : [1, 2, 4],
          'order_id' : [100, 200, 300],
          'order_date' : ['2021-01-21', '2021-02-03', '2020-10-01']
}

b = pd.DataFrame(b_data)
b

   id  order_id  order_date
0   1       100  2021-01-21
1   2       200  2021-02-03
2   4       300  2020-10-01

#### 두 데이터프레임 연결하기
- 1. concat() : 두 데이터 프레임을 연결<br>
    ex) 위 아래 or 왼쪽 오른쪽 으로 합친다

In [5]:
pd.concat([a, b])
# default

   id  customer_id customer_name  order_id  order_date
0   1          1.0        Robert       NaN         NaN
1   2          2.0         Peter       NaN         NaN
2   3          3.0          Dave       NaN         NaN
0   1          NaN           NaN     100.0  2021-01-21
1   2          NaN           NaN     200.0  2021-02-03
2   4          NaN           NaN     300.0  2020-10-01

In [6]:
pd.concat([a, b], axis=1)

   id  customer_id customer_name  id  order_id  order_date
0   1            1        Robert   1       100  2021-01-21
1   2            2         Peter   2       200  2021-02-03
2   3            3          Dave   4       300  2020-10-01

- 2. merge() : 두 데이터프레임에 동일한 이름을 가진 컬럼을 기준으로 합쳐진다.<br>
                중복된것만 출력

In [7]:
pd.merge(a, b)

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert       100  2021-01-21
1   2            2         Peter       200  2021-02-03

- merge(pd1, pd2, on=기준컬럼명) : 기준 컬럼을 명시한다.

In [8]:
pd.merge(a, b, on='id')

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert       100  2021-01-21
1   2            2         Peter       200  2021-02-03

#### merge() 를 통해 두 데이터 프레임을 결합하는가.
- merge(pd1, pd2, how=inner)<br>
default = inner

SQL에서 join문과 동일<br><br>
    - inner : 내부 join<br>
    - left : 왼쪽 join<br>
    - right : 오른쪽 join<br>
    - outer : 외부 join

In [9]:
pd.merge(a, b, how= 'left')

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert     100.0  2021-01-21
1   2            2         Peter     200.0  2021-02-03
2   3            3          Dave       NaN         NaN

In [10]:
pd.merge(a, b)

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert       100  2021-01-21
1   2            2         Peter       200  2021-02-03

In [11]:
a = a.set_index('id')
a

    customer_id customer_name
id
1             1        Robert
2             2         Peter
3             3          Dave

In [12]:
b = b.set_index('id')
b

    order_id  order_date
id
1        100  2021-01-21
2        200  2021-02-03
4        300  2020-10-01

In [21]:
pd.merge(a, b, left_index=True, right_index=True)

    customer_id customer_name  order_id  order_date
id
1             1        Robert       100  2021-01-21
2             2         Peter       200  2021-02-03

In [22]:
pd.merge(a, b, how='outer', left_index=True, right_index=True)

    customer_id customer_name  order_id  order_date
id
1           1.0        Robert     100.0  2021-01-21
2           2.0         Peter     200.0  2021-02-03
3           3.0          Dave       NaN         NaN
4           NaN           NaN     300.0  2020-10-01